; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Hanoi Tower
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(define (domain HANOI)
	(:requirements :strips :typing :negative-preconditions)
	(:types disk case)
	(:predicates
		(on_disk ?d1 - disk ?d2 - disk)
		(bigger ?d1 - disk ?d2 - disk)
		(on_case ?d1 - disk ?c - case)
		(clear_disk ?d - disk)
		(clear_case ?c - case)
		(handempty)
		(holding ?d - disk)
	)

	(:action pick_up
		 :parameters (?d - disk ?c - case)
	     	 :precondition (and (clear_disk ?d) (on_case ?d ?c) (handempty))
	     	 :effect
	     	 (and (not (on_case ?d ?c))
		      (clear_case ?c)
		      (not (clear_disk ?d))
		      (not (handempty))
		      (holding ?d)
		 )
	)
	(:action unstack
 		 :parameters (?d - disk ?d2 - disk)
	     	 :precondition (and (clear_disk ?d) (on_disk ?d ?d2) (handempty))
	     	 :effect
	     	 (and (not (on_disk ?d ?d2))
		      (not (clear_disk ?d))
		      	   (clear_disk ?d2)
		      (not (handempty))
		      (holding ?d)
		 )
	)

	(:action put_down
		 :parameters (?d - disk ?c - case)
		 :precondition (and (clear_case ?c) (holding ?d) )
		 :effect
		 (and (not (clear_case ?c))
		      (not (holding ?d))
		      (clear_disk ?d)
		      (on_case ?d ?c)
		      (handempty)
		 )
	)

	(:action stack
		 :parameters (?d1 - disk ?d2 - disk)
		 :precondition (and (clear_disk ?d2) (holding ?d1) (bigger ?d2 ?d1))
		 :effect
		 (and (not (clear_disk ?d2))
		      (not (holding ?d1))
		      (on_disk ?d1 ?d2)
		      (clear_disk ?d1)
		      (handempty)
		 )
	)
)

; problem
(define (problem HANOI_4)
(:domain HANOI)
(:objects D1 D2 D3 D4 - disk
	  C1 C2 C3 - case
)
(:init
	(handempty)
	(bigger D1 D2)
	(bigger D1 D3)
	(bigger D1 D4)
	(bigger D2 D3)
	(bigger D2 D4)
	(bigger D3 D4)
	(clear_case C1)
	(clear_case C2)
	(on_case D1 C3)
	(on_disk D2 D1)
	(on_disk D3 D2)
	(on_disk D4 D3)
	(clear_disk D4)
)
(:goal
	(and (clear_disk D4)
	     (on_case D1 C1)
	     (on_disk D2 D1)
	     (on_disk D3 D2)
	     (on_disk D4 D3)
	     (handempty)
	)
))

; plan
1. (unstack d4 d3)
   deleted: (on_disk d4 d3) (clear_disk d4) (handempty)
   added: (clear_disk d3) (holding d4)
   goals met: 2 of 6
2. (put_down d4 c1)
   deleted: (clear_case c1) (holding d4)
   added: (clear_disk d4) (on_case d4 c1) (handempty)
   goals met: 4 of 6
3. (unstack d3 d2)
   deleted: (on_disk d3 d2) (clear_disk d3) (handempty)
   added: (clear_disk d2) (holding d3)
   goals met: 2 of 6
4. (put_down d3 c2)
   deleted: (clear_case c2) (holding d3)
   added: (clear_disk d3) (on_case d3 c2) (handempty)
   goals met: 3 of 6
5. (pick_up d4 c1)
   deleted: (on_case d4 c1) (clear_disk d4) (handempty)
   added: (clear_case c1) (holding d4)
   goals met: 1 of 6
6. (stack d4 d3)
   deleted: (clear_disk d3) (holding d4)
   added: (on_disk d4 d3) (clear_disk d4) (handempty)
   goals met: 4 of 6
7. (unstack d2 d1)
   deleted: (on_disk d2 d1) (clear_disk d2) (handempty)
   added: (clear_disk d1) (holding d2)
   goals met: 2 of 6
8. (put_down d2 c1)
   deleted: (clear_case c1) (holding d2)
   added: (clear_disk d2) (on_case d2 c1) (handempty)
   goals met: 3 of 6
9. (unstack d4 d3)
   deleted: (on_disk d4 d3) (clear_disk d4) (handempty)
   added: (clear_disk d3) (holding d4)
   goals met: 0 of 6
10. (stack d4 d1)
   deleted: (clear_disk d1) (holding d4)
   added: (on_disk d4 d1) (clear_disk d4) (handempty)
   goals met: 2 of 6
11. (pick_up d3 c2)
   deleted: (on_case d3 c2) (clear_disk d3) (handempty)
   added: (clear_case c2) (holding d3)
   goals met: 1 of 6
12. (stack d3 d2)
   deleted: (clear_disk d2) (holding d3)
   added: (on_disk d3 d2) (clear_disk d3) (handempty)
   goals met: 3 of 6
13. (unstack d4 d1)
   deleted: (on_disk d4 d1) (clear_disk d4) (handempty)
   added: (clear_disk d1) (holding d4)
   goals met: 1 of 6
14. (put_down d4 c2)
   deleted: (clear_case c2) (holding d4)
   added: (clear_disk d4) (on_case d4 c2) (handempty)
   goals met: 3 of 6
15. (unstack d3 d2)
   deleted: (on_disk d3 d2) (clear_disk d3) (handempty)
   added: (clear_disk d2) (holding d3)
   goals met: 1 of 6
16. (stack d3 d1)
   deleted: (clear_disk d1) (holding d3)
   added: (on_disk d3 d1) (clear_disk d3) (handempty)
   goals met: 2 of 6
17. (pick_up d4 c2)
   deleted: (on_case d4 c2) (clear_disk d4) (handempty)
   added: (clear_case c2) (holding d4)
   goals met: 0 of 6
18. (stack d4 d3)
   deleted: (clear_disk d3) (holding d4)
   added: (on_disk d4 d3) (clear_disk d4) (handempty)
   goals met: 3 of 6
19. (pick_up d2 c1)
   deleted: (on_case d2 c1) (clear_disk d2) (handempty)
   added: (clear_case c1) (holding d2)
   goals met: 2 of 6
20. (put_down d2 c2)
   deleted: (clear_case c2) (holding d2)
   added: (clear_disk d2) (on_case d2 c2) (handempty)
   goals met: 3 of 6
21. (unstack d4 d3)
   deleted: (on_disk d4 d3) (clear_disk d4) (handempty)
   added: (clear_disk d3) (holding d4)
   goals met: 0 of 6
22. (put_down d4 c1)
   deleted: (clear_case c1) (holding d4)
   added: (clear_disk d4) (on_case d4 c1) (handempty)
   goals met: 2 of 6
23. (unstack d3 d1)
   deleted: (on_disk d3 d1) (clear_disk d3) (handempty)
   added: (clear_disk d1) (holding d3)
   goals met: 1 of 6
24. (stack d3 d2)
   deleted: (clear_disk d2) (holding d3)
   added: (on_disk d3 d2) (clear_disk d3) (handempty)
   goals met: 3 of 6
25. (pick_up d4 c1)
   deleted: (on_case d4 c1) (clear_disk d4) (handempty)
   added: (clear_case c1) (holding d4)
   goals met: 1 of 6
26. (stack d4 d3)
   deleted: (clear_disk d3) (holding d4)
   added: (on_disk d4 d3) (clear_disk d4) (handempty)
   goals met: 4 of 6
27. (pick_up d1 c3)
   deleted: (on_case d1 c3) (clear_disk d1) (handempty)
   added: (clear_case c3) (holding d1)
   goals met: 3 of 6
28. (put_down d1 c1)
   deleted: (clear_case c1) (holding d1)
   added: (clear_disk d1) (on_case d1 c1) (handempty)
   goals met: 5 of 6
29. (unstack d4 d3)
   deleted: (on_disk d4 d3) (clear_disk d4) (handempty)
   added: (clear_disk d3) (holding d4)
   goals met: 2 of 6
30. (put_down d4 c3)
   deleted: (clear_case c3) (holding d4)
   added: (clear_disk d4) (on_case d4 c3) (handempty)
   goals met: 4 of 6
31. (unstack d3 d2)
   deleted: (on_disk d3 d2) (clear_disk d3) (handempty)
   added: (clear_disk d2) (holding d3)
   goals met: 2 of 6
32. (stack d3 d1)
   deleted: (clear_disk d1) (holding d3)
   added: (on_disk d3 d1) (clear_disk d3) (handempty)
   goals met: 3 of 6
33. (pick_up d4 c3)
   deleted: (on_case d4 c3) (clear_disk d4) (handempty)
   added: (clear_case c3) (holding d4)
   goals met: 1 of 6
34. (stack d4 d2)
   deleted: (clear_disk d2) (holding d4)
   added: (on_disk d4 d2) (clear_disk d4) (handempty)
   goals met: 3 of 6
35. (unstack d3 d1)
   deleted: (on_disk d3 d1) (clear_disk d3) (handempty)
   added: (clear_disk d1) (holding d3)
   goals met: 2 of 6
36. (put_down d3 c3)
   deleted: (clear_case c3) (holding d3)
   added: (clear_disk d3) (on_case d3 c3) (handempty)
   goals met: 3 of 6
37. (unstack d4 d2)
   deleted: (on_disk d4 d2) (clear_disk d4) (handempty)
   added: (clear_disk d2) (holding d4)
   goals met: 1 of 6
38. (stack d4 d3)
   deleted: (clear_disk d3) (holding d4)
   added: (on_disk d4 d3) (clear_disk d4) (handempty)
   goals met: 4 of 6
39. (pick_up d2 c2)
   deleted: (on_case d2 c2) (clear_disk d2) (handempty)
   added: (clear_case c2) (holding d2)
   goals met: 3 of 6
40. (stack d2 d1)
   deleted: (clear_disk d1) (holding d2)
   added: (on_disk d2 d1) (clear_disk d2) (handempty)
   goals met: 5 of 6
41. (unstack d4 d3)
   deleted: (on_disk d4 d3) (clear_disk d4) (handempty)
   added: (clear_disk d3) (holding d4)
   goals met: 2 of 6
42. (put_down d4 c2)
   deleted: (clear_case c2) (holding d4)
   added: (clear_disk d4) (on_case d4 c2) (handempty)
   goals met: 4 of 6
43. (pick_up d3 c3)
   deleted: (on_case d3 c3) (clear_disk d3) (handempty)
   added: (clear_case c3) (holding d3)
   goals met: 3 of 6
44. (stack d3 d2)
   deleted: (clear_disk d2) (holding d3)
   added: (on_disk d3 d2) (clear_disk d3) (handempty)
   goals met: 5 of 6
45. (pick_up d4 c2)
   deleted: (on_case d4 c2) (clear_disk d4) (handempty)
   added: (clear_case c2) (holding d4)
   goals met: 3 of 6
46. (stack d4 d3)
   deleted: (clear_disk d3) (holding d4)
   added: (on_disk d4 d3) (clear_disk d4) (handempty)
   goals met: 6 of 6
